[{"name":"nginx","link":"/_/nginx/","description":"Official build of Nginx."},{"name":"busybox","link":"/_/busybox/","description":"Busybox base image."},{"name":"redis","link":"/_/redis/","description":"Redis is an open source key-value store that functions as a data structure server."},{"name":"ubuntu","link":"/_/ubuntu/","description":"Ubuntu is a Debian-based Linux operating system based on free software."},{"name":"registry","link":"/_/registry/","description":"Containerized docker registry"},{"name":"swarm","link":"/_/swarm/","description":"Swarm: a Docker-native clustering system."},{"name":"mongo","link":"/_/mongo/","description":"MongoDB document databases provide high availability and easy scalability."},{"name":"mysql","link":"/_/mysql/","description":"MySQL is a widely used, open-source relational database management system (RDBMS)."},{"name":"alpine","link":"/_/alpine/","description":"A minimal Docker image based on Alpine Linux with a complete package index and only 5 MB in size!"},{"name":"node","link":"/_/node/","description":"Node.js is a JavaScript-based platform for server-side and networking applications."},{"name":"postgres","link":"/_/postgres/","description":"The PostgreSQL object-relational database system provides reliability and data integrity."},{"name":"elasticsearch","link":"/_/elasticsearch/","description":"Elasticsearch is a powerful open source search and analytics engine that makes data easy to explore."},{"name":"hello-world","link":"/_/hello-world/","description":"Hello World! (an example of minimal Dockerization)"},{"name":"httpd","link":"/_/httpd/","description":"The Apache HTTP Server Project"},{"name":"wordpress","link":"/_/wordpress/","description":"The WordPress rich content management system can utilize plugins, widgets, and themes."},{"name":"debian","link":"/_/debian/","description":"Debian is a Linux distribution that's composed entirely of free and open-source software."},{"name":"logstash","link":"/_/logstash/","description":"Logstash is a tool for managing events and logs."},{"name":"centos","link":"/_/centos/","description":"The official build of CentOS."},{"name":"java","link":"/_/java/","description":"Java is a concurrent, class-based, and object-oriented programming language."},{"name":"jenkins","link":"/_/jenkins/","description":"Official Jenkins Docker image"},{"name":"python","link":"/_/python/","description":"Python is an interpreted, interactive, object-oriented, open-source programming language."},{"name":"rabbitmq","link":"/_/rabbitmq/","description":"RabbitMQ is a highly reliable enterprise messaging system based on the emerging AMQP standard"},{"name":"kibana","link":"/_/kibana/","description":"Kibana gives shape to any kind of data — structured and unstructured — indexed in Elasticsearch."},{"name":"ruby","link":"/_/ruby/","description":"Ruby is a dynamic, reflective, object-oriented, general-purpose, open-source programming language."},{"name":"php","link":"/_/php/","description":"While designed for web development, the PHP scripting language also provides general-purpose use."},{"name":"haproxy","link":"/_/haproxy/","description":"HAProxy - The Reliable, High Performance TCP/HTTP Load Balancer"},{"name":"golang","link":"/_/golang/","description":"Go (golang) is a general purpose, higher-level, imperative programming language."},{"name":"tomcat","link":"/_/tomcat/","description":"Apache Tomcat is an open source implementation of the Java Servlet and JavaServer Pages technologies"},{"name":"memcached","link":"/_/memcached/","description":"Free & open source, high-performance, distributed memory object caching system."},{"name":"fedora","link":"/_/fedora/","description":"Official Docker builds of Fedora"},{"name":"mariadb","link":"/_/mariadb/","description":"MariaDB is a community-developed fork of MySQL intended to remain free under the GNU GPL."},{"name":"docker","link":"/_/docker/","description":"Docker in Docker!"},{"name":"consul","link":"/_/consul/","description":"Consul is a datacenter runtime that provides service discovery, configuration, and orchestration."},{"name":"rethinkdb","link":"/_/rethinkdb/","description":"RethinkDB is an open-source, document database that makes it easy to build and scale realtime apps."},{"name":"perl","link":"/_/perl/","description":"Perl is a high-level, general-purpose, interpreted, dynamic programming language."},{"name":"cassandra","link":"/_/cassandra/","description":"Apache Cassandra is an open-source distributed storage system."},{"name":"maven","link":"/_/maven/","description":"Apache Maven is a software project management and comprehension tool."},{"name":"ubuntu-debootstrap","link":"/_/ubuntu-debootstrap/","description":"debootstrap --variant=minbase --components=main,universe --include=inetutils-ping,iproute2 <suite> /"},{"name":"ghost","link":"/_/ghost/","description":"Ghost is a free and open source blogging platform written in JavaScript"},{"name":"nats","link":"/_/nats/","description":"NATS is an open-source, high-performance, cloud native messaging system."},{"name":"oraclelinux","link":"/_/oraclelinux/","description":"Oracle Linux is an open-source operating system suitable for general purpose or Oracle workloads."},{"name":"rails","link":"/_/rails/","description":"Rails is an open-source web application framework written in Ruby."},{"name":"neo4j","link":"/_/neo4j/","description":"Neo4j is a highly scalable, robust native graph database."},{"name":"iojs","link":"/_/iojs/","description":"io.js is an npm compatible platform originally based on node.js"},{"name":"owncloud","link":"/_/owncloud/","description":"ownCloud is a self-hosted file sync and share server."},{"name":"django","link":"/_/django/","description":"Django is a free web application framework, written in Python."},{"name":"sentry","link":"/_/sentry/","description":"Sentry is a realtime, platform-agnostic error logging and aggregation platform"},{"name":"notary","link":"/_/notary/","description":"Notary server and signer cooperatively handle signing and distribution of notary repositories."},{"name":"jruby","link":"/_/jruby/","description":"JRuby (http://www.jruby.org) is an implementation of Ruby (http://www.ruby-lang.org) on the JVM."},{"name":"buildpack-deps","link":"/_/buildpack-deps/","description":"A collection of common build dependencies used for installing various modules, e.g., gems."},{"name":"telegraf","link":"/_/telegraf/","description":"Telegraf is an agent for collecting metrics and writing them to InfluxDB or other outputs."},{"name":"rocket.chat","link":"/_/rocket.chat/","description":"The Complete Open Source Chat Solution"},{"name":"pypy","link":"/_/pypy/","description":"PyPy is a fast, compliant alternative implementation of the Python language."},{"name":"odoo","link":"/_/odoo/","description":"Odoo (formerly known as OpenERP) is a suite of open-source business apps."},{"name":"sonarqube","link":"/_/sonarqube/","description":"SonarQube is an open source platform for continuous inspection of code quality."},{"name":"jetty","link":"/_/jetty/","description":"Jetty provides a Web server and javax.servlet container."},{"name":"couchbase","link":"/_/couchbase/","description":"Couchbase Server is a NoSQL document database with a distributed architecture."},{"name":"drupal","link":"/_/drupal/","description":"Drupal is an open source content management platform powering millions of websites and applications."},{"name":"mono","link":"/_/mono/","description":"Mono is an open source implementation of Microsoft's .NET Framework"},{"name":"joomla","link":"/_/joomla/","description":"Joomla! is an open source content management system."},{"name":"redmine","link":"/_/redmine/","description":"Redmine is a flexible project management web application written using Ruby on Rails framework"},{"name":"percona","link":"/_/percona/","description":"Percona Server is a fork of the MySQL relational database management system created by Percona."},{"name":"traefik","link":"/_/traefik/","description":"Træfɪk, a modern reverse proxy"},{"name":"crate","link":"/_/crate/","description":"Crate is an open source, highly scalable, shared-nothing distributed SQL database."},{"name":"gcc","link":"/_/gcc/","description":"The GNU Compiler Collection is a compiling system that supports several languages."},{"name":"websphere-liberty","link":"/_/websphere-liberty/","description":"Official IBM WebSphere Application Server for Developers Liberty image."},{"name":"arangodb","link":"/_/arangodb/","description":"ArangoDB - a distributed database with a flexible data model for documents, graphs, and key-values."},{"name":"glassfish","link":"/_/glassfish/","description":"GlassFish is the reference implementation of Java EE"},{"name":"neurodebian","link":"/_/neurodebian/","description":"NeuroDebian provides neuroscience research software for Debian, Ubuntu, and other derivatives."},{"name":"solr","link":"/_/solr/","description":"Solr is the popular, blazing-fast, open source enterprise search platform built on Apache Lucene™."},{"name":"tomee","link":"/_/tomee/","description":"Apache TomEE is an all-Apache Java EE certified stack where Apache Tomcat is top dog."},{"name":"erlang","link":"/_/erlang/","description":"Erlang is a programming language used to build massively scalable systems with high availability."},{"name":"docker-dev","link":"/_/docker-dev/","description":"Docker is an open source project to pack, ship and run any application as a lightweight container"},{"name":"aerospike","link":"/_/aerospike/","description":"Aerospike – the reliable, high performance, distributed database optimized for flash and RAM."},{"name":"hylang","link":"/_/hylang/","description":"Hy is a Lisp dialect that translates expressions into Python's abstract syntax tree."},{"name":"irssi","link":"/_/irssi/","description":"irssi - The IRC client of the future"},{"name":"opensuse","link":"/_/opensuse/","description":"This project contains the stable releases of the openSUSE distribution."},{"name":"clojure","link":"/_/clojure/","description":"Clojure is a dialect of Lisp that runs on the JVM."},{"name":"scratch","link":"/_/scratch/","description":"an explicitly empty image, especially for building images \"FROM scratch\""},{"name":"ros","link":"/_/ros/","description":"The Robot Operating System (ROS) is an open source project for building robot applications."},{"name":"celery","link":"/_/celery/","description":"Celery is an open source asynchronous task queue/job queue based on distributed message passing."},{"name":"ubuntu-upstart","link":"/_/ubuntu-upstart/","description":"Upstart is an event-based replacement for the /sbin/init daemon which starts processes at boot"},{"name":"haskell","link":"/_/haskell/","description":"Haskell is an advanced purely-functional programming language."},{"name":"php-zendserver","link":"/_/php-zendserver/","description":"Zend Server - the integrated PHP application platform for mobile and web apps."},{"name":"cirros","link":"/_/cirros/","description":"CirrOS is a Tiny OS that specializes in running on a cloud."},{"name":"julia","link":"/_/julia/","description":"Julia is a high-level, high-performance dynamic programming language for technical computing."},{"name":"influxdb","link":"/_/influxdb/","description":"InfluxDB is an open source time series database for recording metrics, events, and analytics."},{"name":"r-base","link":"/_/r-base/","description":"R is a system for statistical computation and graphics."},{"name":"gazebo","link":"/_/gazebo/","description":"Gazebo is an open source project for simulating robots, offering robust physics and rendering."},{"name":"mongo-express","link":"/_/mongo-express/","description":"Web-based MongoDB admin interface, written with Node.js and express"},{"name":"nuxeo","link":"/_/nuxeo/","description":"Nuxeo is an open source Content Management Platform that is completely customizable."},{"name":"couchdb","link":"/_/couchdb/","description":"CouchDB is a database that uses JSON for documents, JavaScript for MapReduce and HTTP for its API."},{"name":"rakudo-star","link":"/_/rakudo-star/","description":"Rakudo Perl 6, or simply Rakudo, is a compiler for the Perl 6 programming language."},{"name":"elixir","link":"/_/elixir/","description":"Elixir is a dynamic, functional language for building scalable and maintainable applications."},{"name":"hipache","link":"/_/hipache/","description":"Hipache is a distributed proxy for high volumes of http/websocket traffic to large numbers of hosts"},{"name":"thrift","link":"/_/thrift/","description":"Thrift is a framework for generating client and services from an IDL."},{"name":"backdrop","link":"/_/backdrop/","description":"The comprehensive CMS for small to medium sized businesses and non-profits."},{"name":"mageia","link":"/_/mageia/","description":"Official Mageia base image"},{"name":"bonita","link":"/_/bonita/","description":"Bonita BPM is an open-source business process management and workflow suite"},{"name":"crux","link":"/_/crux/","description":"CRUX is a lightweight Linux distribution targeted at experienced Linux users"},{"name":"orientdb","link":"/_/orientdb/","description":"OrientDB a Multi-Model Open Source NoSQL DBMS that combines graphs and documents."},{"name":"vault","link":"/_/vault/","description":"Vault is a tool for securely accessing secrets via a unified interface and tight access control."},{"name":"kapacitor","link":"/_/kapacitor/","description":"Kapacitor is an open source framework for processing, monitoring, and alerting on time series data."},{"name":"piwik","link":"/_/piwik/","description":"Piwik is the leading open-source analytics platform that gives you more than powerful analytics."},{"name":"openjdk","link":"/_/openjdk/","description":"OpenJDK is an open-source implementation of the Java Platform, Standard Edition"},{"name":"photon","link":"/_/photon/","description":"Photon OS is a technology preview of a minimal Linux container host."},{"name":"kaazing-gateway","link":"/_/kaazing-gateway/","description":"Official build of Kaazing Gateway."},{"name":"lightstreamer","link":"/_/lightstreamer/","description":"Lightstreamer is a real-time messaging server optimized for the Internet."},{"name":"chronograf","link":"/_/chronograf/","description":"Chronograf is a visualization tool for time series data in InfluxDB."},{"name":"sourcemage","link":"/_/sourcemage/","description":"Source Mage is a source-based GNU/Linux distribution with maximum flexibility in customization."},{"name":"spiped","link":"/_/spiped/","description":"Spiped is a utility for creating symmetrically encrypted and authenticated pipes between sockets."},{"name":"ibmjava","link":"/_/ibmjava/","description":"Official IBM® SDK, Java™ Technology Edition Docker Image."},{"name":"eggdrop","link":"/_/eggdrop/","description":"The official Docker image of Eggdrop- IRC's oldest actively-developed bot!"},{"name":"fsharp","link":"/_/fsharp/","description":"F# is a multi-paradigm language encompassing functional, imperative, and object-oriented styles"},{"name":"clearlinux","link":"/_/clearlinux/","description":"Official docker build of Clear Linux OS for Intel Architecture"},{"name":"hello-seattle","link":"/_/hello-seattle/","description":"Hello from DockerCon 2016 (Seattle)!"},{"name":"hola-mundo","link":"/_/hola-mundo/","description":"¡Hola de DockerCon EU 2015 (Barcelona)!"},{"name":"kong","link":"/_/kong/","description":"Open-source Microservice & API Management layer built on top of NGINX."}]